str1 = "Принцесса Даниэла очень хотела порадовать своего принца. Она приготовила ему такой чудесный подарок, " \
       "а в королевстве ни одной кареты до вечера. «Какой кошмар!» - Даниэла была в гневе. «Как это так, я Принцесса! " \
       "Для меня всегда должны быть кареты». Она расплакалась, еще никогда ее планы не рушились так сильно. "

str2 = """Услышав рыдания принцессы, ее верный друг поросенок тут же прибежал к ней. 
-Что случилось, Даниээла? – впопыхах спросил поросенок. 
-В целом королевстве нет ни одной кареты, которая бы смогла отвезти этот чудесный подарок графу Ярославу. 
-Давай я отнесу, - гордо предложил поросенок.
-А ты сможешь? Не устанешь? – спросила Даниэла. На ее лице уже появилась милая улыбка.
-Раз предлагаю – смогу! Давай сюда подарок и адрес. 
Принцесса вручила поросенку коробку и бумажку с адресом. 
-Спасибо огромное! Будь осторожнее сказала она. - Даниэла обняла поросенка и он побежал"""

str3 = "Добежав до королевского сада, поросенок увидел, что он потерял открытку. Он уж было хотел вернуться назад, " \
       "чтобы ее искать, но к нему подлетела птичка, которая сказала, что открытку украла овечка-клептоманка и что " \
       "она побежала вперед по другой прямой дороге. Задачка: Овечка бежит по прямой дороге со скоростью 4 м/с. " \
       "Поросенок н будет бежать за овечкой всегда, двигаясь по направлению к ней. Поросенок начнет бежать за овечкой " \
       "прямо от королевского сада, который находится в 600 м от дороги, где бежит овечка. С какой скоростью нужно " \
       "будет бежать за овечкой, чтобы добраться до нее за 100 секунд? "

str4 = """Догнав овечку, поросенок крикнул ей, что он знает, что это она украла открытку для Ярослава. -Бееее! 
Неправда, это не так. Я хотела отнести ее Ярославу в обмен на листик с загадкой из коробки его сигарет. Мне очень 
нужно ее решить, иначе  – возразила Овечка. -Ооо, я видел эту загадку и, кажется, знаю ответ на нее, 
– сказал поросенок, -Дааа? И какой же там ответ? Я отдам тебе открытку, ты только скажи! """

str5 = """-Ооой, спасибо тебе огромное, милый поросенок! Вот, забирай открытку! Кстати, мы тоже послали Ярославу подарок от нашего овечьего королевства. И подарок уже должен ждать его в на его рабочем столе. 
-Я обязательно его предупрежу! А ты не воруй больше!
-Конечно-конечно! Удачи тебе милый поросенок!"""

str6 = "Поросенок продолжил свой путь. Вдруг на своем пути он увидел огромные ворота, а рядом с ними стоял страж, " \
       "который никого не впускал туда. Это было Великое Российское Королевство, войти в которое мог лишь русский или " \
       "тот, кто с ними дружил. Поросенок подошел к стражу, это был огрооомный мужик с запачканной рубашкой. «И после " \
       "этого они нас свиньями называют…» Подумал поросенок. "

str7 = """-Что тебе надо здесь? К кому идешь?
-Я… Я к Вашему королю Сергею.
-Неужели? И ты, Свинья, думаешь, что я тебе поверю? Ну-ну, если к его величеству Сергею ты держишь путь, то наверняка знаешь ответ на его загадку, ведь этот ответ и является паролем в наше королевство. Ну что, какой пароль?
-Хммм…- поросенок уставился на стражника, - мне надо пару минут вспомнить!
-Да хоть десять часов.
 «Я и загадки-то не знаю, а он ответ хочет, »- подумал поросенок. «Вот бы кто-то помог мне понять, что за загадка там такая интересная, а еще лучше узнать ответ на нее»
-Ну что, вспомнил?"""

str8 = """-Ну ничего себе! А я уж думал, что ты наврал мне! Проходи и передавай мое почтение его Величеству.
Стражник открыл ворота и поросенок побежал дальше.
-Ага, конечно передам! – усмехнулся поросенок, отбежав подальше. Поросенок знал, что совсем скоро он добежит до Графства Ярослава и его это очень радовало.
Уже около замка Ярослава у поросенка вновь возникла проблема. Ярослав, судя по всему, был очень занят и поросенку пришлось оставить подарок в сундуке Ярослава, только осталось угадать пароль. Поросенок знал,что пароль к нему состоял из четырёх цифр. Чтобы открыть сундук, нужно было сказать эти цифры быку и корове, стоящим рядом. 
Поросенок решил наугад сказать 4 цифры:"""

str9 = "Оставив подарок в сундуке, поросенок вернулся в королевство Даниэлы. Она была очень рада тому, что поросенок ей так помог. И уже через пару часов они мчались в карете к Ярославу."

# img1 = 'Images/1.jpg'
# img2 = 'Images/2.jpg'
# img3 = 'Images/3.jpg'
# img4 = 'Images/4.jpg'
# img5 = 'Images/5.jpg'
# img6 = 'Images/6.jpg'
# img9 = 'Images/9.jpg'

img1 = 'AgACAgIAAxkDAAMEX4NAM71sw_RoTSg2kItT2iqfR_cAAkuuMRvz5iFIPsStXzihrx67M-2XLgADAQADAgADeQAD4ZIBAAEbBA'
img2 = 'AgACAgIAAxkDAAMHX4NATAEs8CEDsNDAbtxNaLDx77wAAkyuMRvz5iFIeeZgtML4K7Eh_RyVLgADAQADAgADeQAD6SQFAAEbBA'
img3 = 'AgACAgIAAxkDAAMKX4NAXUoa-_5sKUfKM9jfZQyXMHgAAk2uMRvz5iFIDpNkm3OGpIW6HMqXLgADAQADAgADeQAD6ncBAAEbBA'
img4 = 'AgACAgIAAxkDAAMNX4NAbns5xCrN0CnDPOMdf5gkaRwAAk6uMRvz5iFIBC1BolOmp5qa-NWWLgADAQADAgADeQADQEQCAAEbBA'
img5 = 'AgACAgIAAxkDAAMQX4NAhdD1gMd43bJvpsEefX6jPXgAAk-uMRvz5iFIke2W5Opwu4Ut_ByVLgADAQADAgADeQADczEFAAEbBA'
img6 = 'AgACAgIAAxkDAAMTX4NAofOT_Lb2XWzG05fuWIZTvPMAAlCuMRvz5iFI0CJq5tIwTafjDkiWLgADAQADAgADeQADwfQCAAEbBA'
img9 = 'AgACAgIAAxkDAAMdX4NAu3Jd29vmW2YEj3SXUBDKY48AAlGuMRvz5iFIDSVv9KF_u6RAaBiVLgADAQADAgADeQAD7i0FAAEbBA'
